In [27]:
import pandas as pd

In [175]:
# How to read a data in pandas
df = pd.read_csv('Weather_data_1.csv')
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees,Unnamed: 11
0,01-01-2016,38.0,23.0,52.0,30.03,10.0,8.0,0,5.0,NaN,281.0,NaN
1,01-02-2016,36.0,18.0,46.0,30.02,10.0,7.0,0,3.0,NaN,275.0,NaN
2,01-03-2016,40.0,21.0,47.0,29.86,10.0,8.0,0,1.0,NaN,277.0,NaN
3,01-04-2016,25.0,9.0,44.0,30.05,10.0,9.0,0,3.0,NaN,345.0,NaN
4,01-05-2016,20.0,-3.0,41.0,30.57,10.0,5.0,0,0.0,NaN,333.0,NaN

In [2]:
# get the maximum temperature
df['Temperature'].max()

50.0

In [3]:
# to know which day it rain
df[df['Events']=='Rain']

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees,Unnamed: 11
8,01-09-2016,44.0,38.0,77.0,30.16,9.0,8.0,T,8.0,Rain,76.0,NaN
9,01-10-2016,50.0,46.0,71.0,29.59,4.0,NaN,1.8,7.0,Rain,109.0,NaN
15,1/16/2016,47.0,37.0,70.0,29.52,8.0,7.0,0.24,7.0,Rain,340.0,NaN
26,1/27/2016,41.0,22.0,45.0,30.03,10.0,7.0,T,3.0,Rain,311.0,NaN

In [4]:
# Average wind speed
df['WindSpeedMPH'].mean()

6.892857142857143

In [5]:
weather_data = [('1/1/2023',32,7,'sunny'),
               ('2/1/2023',25,12,'rainy'),
               ('3/1/2023',2,11,'snow'),
               ('4/1/2023',30,8,'sunny'),
               ('5/1/2023',27,7,'sunny')]

df2 = pd.DataFrame(weather_data, columns=['date','temperature','windspeedKMH','event'])
df2

       date  temperature  windspeedKMH  event
0  1/1/2023           32             7  sunny
1  2/1/2023           25            12  rainy
2  3/1/2023            2            11   snow
3  4/1/2023           30             8  sunny
4  5/1/2023           27             7  sunny

In [6]:
# get dimension of the table
df2.shape

(5, 4)

In [7]:
# if you want to see initial row use head command (default 5 rows)
df2.head()

       date  temperature  windspeedKMH  event
0  1/1/2023           32             7  sunny
1  2/1/2023           25            12  rainy
2  3/1/2023            2            11   snow
3  4/1/2023           30             8  sunny
4  5/1/2023           27             7  sunny

In [8]:
# If you want to see last row to use Tail command (defualt rows 5)
df2.tail()

       date  temperature  windspeedKMH  event
0  1/1/2023           32             7  sunny
1  2/1/2023           25            12  rainy
2  3/1/2023            2            11   snow
3  4/1/2023           30             8  sunny
4  5/1/2023           27             7  sunny

In [9]:
# slicing the data [rows:columns]
df2[2:5]

       date  temperature  windspeedKMH  event
2  3/1/2023            2            11   snow
3  4/1/2023           30             8  sunny
4  5/1/2023           27             7  sunny

In [10]:
# print columns name
df2.columns

Index(['date', 'temperature', 'windspeedKMH', 'event'], dtype='object')

In [11]:
# print particular column data (there are two way to see a particular column data)
print(df2.temperature)
print()
print(df2['temperature'])

0    32
1    25
2     2
3    30
4    27
Name: temperature, dtype: int64

0    32
1    25
2     2
3    30
4    27
Name: temperature, dtype: int64

In [12]:
# get 2 or more columns data
df2[['date','temperature','event']]

       date  temperature  event
0  1/1/2023           32  sunny
1  2/1/2023           25  rainy
2  3/1/2023            2   snow
3  4/1/2023           30  sunny
4  5/1/2023           27  sunny

In [13]:
# if you see descriptive statistics of specific columns 
df2.temperature.describe()

count     5.000000
mean     23.200000
std      12.153189
min       2.000000
25%      25.000000
50%      27.000000
75%      30.000000
max      32.000000
Name: temperature, dtype: float64

In [14]:
# Select the row which have maximum temperature
df2[df2['temperature']==df2['temperature'].max()]

       date  temperature  windspeedKMH  event
0  1/1/2023           32             7  sunny

In [15]:
df2['temperature']==df2['temperature'].max()

0     True
1    False
2    False
3    False
4    False
Name: temperature, dtype: bool

In [16]:
# Select only day column which has maximum temperature
df2.date[df2['temperature']==df2['temperature'].max()]

0    1/1/2023
Name: date, dtype: object

In [ ]:
# how to save/store data from pc
df2.to_excel('new_data.xlsx',sheet_name='data',index=0)

In [36]:
df3 = pd.read_csv('Bangalore_house.csv')
df3 = df3[0:500]

## Group-by Function

In [46]:
g = df3.groupby('area_type')

In [63]:
for data_city, data_frame in g:
    print(data_city)
#     print(data_frame)

Built-up  Area
Carpet  Area
Plot  Area
Super built-up  Area

In [50]:
# to get specific group
g.get_group('Carpet  Area')

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
297,Carpet Area,Ready To Move,Maruthi Sevanagar,2 BHK,SMikaay,950,2.0,2.0,47.0
340,Carpet Area,Ready To Move,Muneshwara Nagar,2 BHK,NaN,1230,2.0,3.0,48.0
352,Carpet Area,Ready To Move,Sampigehalli,3 BHK,Puens G,1592,3.0,2.0,75.0

In [69]:
# find the maximum values each columns
print(g.max('Carpet  Area'))
# Same as
print(g.max('Plot  Area'))

                      bath  balcony   price
area_type
Built-up  Area         8.0      3.0   420.0
Carpet  Area           3.0      3.0    75.0
Plot  Area             9.0      3.0   760.0
Super built-up  Area   9.0      3.0  2200.0
                      bath  balcony   price
area_type
Built-up  Area         8.0      3.0   420.0
Carpet  Area           3.0      3.0    75.0
Plot  Area             9.0      3.0   760.0
Super built-up  Area   9.0      3.0  2200.0

In [73]:
# find the mean values each columns
print(g.mean(['Plot  Area','Carpet  Area','Built-up  Area ','Super built-up  Area']))

                          bath   balcony       price
area_type
Built-up  Area        2.647727  1.559524   92.502889
Carpet  Area          2.333333  2.333333   56.666667
Plot  Area            3.770270  1.485294  186.040541
Super built-up  Area  2.456193  1.622291   93.533949

In [74]:
print(g.describe())

                       bath                                               \
                      count      mean       std  min  25%  50%  75%  max
area_type
Built-up  Area         88.0  2.647727  1.356464  1.0  2.0  2.0  3.0  8.0
Carpet  Area            3.0  2.333333  0.577350  2.0  2.0  2.0  2.5  3.0
Plot  Area             74.0  3.770270  1.779236  1.0  3.0  3.5  5.0  9.0
Super built-up  Area  331.0  2.456193  0.940849  1.0  2.0  2.0  3.0  9.0

                     balcony            ...            price              \
                       count      mean  ...  75%  max  count        mean
area_type                               ...
Built-up  Area          84.0  1.559524  ...  2.0  3.0   90.0   92.502889
Carpet  Area             3.0  2.333333  ...  2.5  3.0    3.0   56.666667
Plot  Area              68.0  1.485294  ...  2.0  3.0   74.0  186.040541
Super built-up  Area   323.0  1.622291  ...  2.0  3.0  333.0   93.533949


                             std   min    25%    50%     75%     max
area_type
Built-up  Area         73.838145  15.0  45.00   65.5  110.00   420.0
Carpet  Area           15.885003  47.0  47.50   48.0   61.50    75.0
Plot  Area            139.619389  14.0  95.75  152.5  243.75   760.0
Super built-up  Area  137.184941  11.0  48.50   65.0   99.00  2200.0

[4 rows x 24 columns]

## Concatenate 2 dataframe

In [83]:
india_weather = pd.DataFrame({'city':['mumbai','delhi','bangaluru','chennai'],
                   'temperature':[48,46,42,45],
                   'humidity':[65,61,55,82]})
india_weather

        city  temperature  humidity
0     mumbai           48        65
1      delhi           46        61
2  bangaluru           42        55
3    chennai           45        82

In [84]:
us_weather = pd.DataFrame({'city':['chicago','nurembourg','washingtonDC','NewYork'],
                   'temperature':[32,28,29,35],
                   'humidity':[55,51,45,62]})
us_weather

           city  temperature  humidity
0       chicago           32        55
1    nurembourg           28        51
2  washingtonDC           29        45
3       NewYork           35        62

In [92]:
# concat two dataframes
df4 = pd.concat([india_weather,us_weather],ignore_index=True,axis=0)
df4

           city  temperature  humidity
0        mumbai           48        65
1         delhi           46        61
2     bangaluru           42        55
3       chennai           45        82
4       chicago           32        55
5    nurembourg           28        51
6  washingtonDC           29        45
7       NewYork           35        62

In [91]:
pd.concat([india_weather,us_weather],axis=1)

        city  temperature  humidity          city  temperature  humidity
0     mumbai           48        65       chicago           32        55
1      delhi           46        61    nurembourg           28        51
2  bangaluru           42        55  washingtonDC           29        45
3    chennai           45        82       NewYork           35        62

## Merge DataFrame

In [104]:
tem_df = pd.DataFrame({'city':['mumbai','delhi','bangaluru','chennai','puna'],
                   'temperature':[48,46,42,45,54]
                   })
tem_df

        city  temperature
0     mumbai           48
1      delhi           46
2  bangaluru           42
3    chennai           45
4       puna           54

In [113]:
hum_df = pd.DataFrame({'city':['mumbai','delhi','bangaluru','chennai'],
                   'humidity':[55,51,45,62]})
hum_df

        city  humidity
0     mumbai        55
1      delhi        51
2  bangaluru        45
3    chennai        62

In [116]:
# pd.merge method to merge dataframes | WE ARE JOIN TWO TABLE USING CITY NAME (inner join)
pd.merge(tem_df, hum_df, on='city')

        city  temperature  humidity
0     mumbai           48        55
1      delhi           46        51
2  bangaluru           42        45
3    chennai           45        62

In [117]:
# Outer Join
pd.merge(tem_df, hum_df, on='city',how='outer')

        city  temperature  humidity
0     mumbai           48      55.0
1      delhi           46      51.0
2  bangaluru           42      45.0
3    chennai           45      62.0
4       puna           54       NaN

## Numerical indexing (.loc vs iloc)

In [171]:
df5 = pd.DataFrame([1,2,3,4,5,6,7,8,9,10],index=[11,12,9,4,5,6,8,10,1,1])
df5

     0
11   1
12   2
9    3
4    4
5    5
6    6
8    7
10   8
1    9
1   10

In [172]:
df5.loc[11]

0    1
Name: 11, dtype: int64

In [173]:
df5.iloc[9]

0    10
Name: 1, dtype: int64